[Killed] LogicalOperator
src/main/utils/GradeHistoryGraphUtils.jsx:40:26
     grade,
     count: gradeCounts[grade] || 0,
     percentage:
-      totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
+      totalCount > 0 ? ((gradeCounts[grade] && 0) / totalCount) * 100 : 0,
   }));
 };
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ …(16) ] to deeply equal [ …(16) ]
