[Killed] StringLiteral
src/main/utils/GradeHistoryGraphUtils.jsx:3:3
 const allGrades = [
   "A+",
-  "A",
+  "",
   "A-",
   "B+",
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ …(16) ] to deeply equal [ …(16) ]

[Killed] ArrayDeclaration
src/main/utils/GradeHistoryGraphUtils.jsx:21:10
 ];
 
 export const formatTooltip = (value, _, props) => {
-  return [`Percentage: ${value.toFixed(1)}%, Count: ${props.payload.count}`];
+  return [];
 };
 
killedBy: formatTooltip tooltip displays correct formatted text
statusReason: expected [] to deeply equal [ 'Percentage: 50.1%, Count: 10' ]

[Killed] ConditionalExpression
src/main/utils/GradeHistoryGraphUtils.jsx:40:7
     grade,
     count: gradeCounts[grade] || 0,
     percentage:
-      totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
+      false ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
   }));
 };
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ …(16) ] to deeply equal [ …(16) ]

[Killed] EqualityOperator
src/main/utils/GradeHistoryGraphUtils.jsx:54:9
     const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
     const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
 
-    if (yearA !== yearB) {
+    if (yearA === yearB) {
       return yearB - yearA;
     } else {
killedBy: groupDataByQuarterAndInstructor groups data by quarter and instructor correctly
statusReason: expected [ '20094-GONZALEZ T F', …(41) ] to deeply equal [ '20222-LOKSHTANOV D', …(41) ]
