[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:24:17
     [page, size],
   );
 
-  const users = pagedUsers?.content || [];
+  const users = false;
   const totalPages = pagedUsers?.totalPages ?? 1;
 
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] OptionalChaining
main/pages/Admin/AdminUsersPage.jsx:25:22
   );
 
   const users = pagedUsers?.content || [];
-  const totalPages = pagedUsers?.totalPages ?? 1;
+  const totalPages = pagedUsers.totalPages ?? 1;
 
   return (
killedBy: AdminUsersPage tests uses fallback values when pagedUsers is null
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] ArrowFunction
main/pages/Admin/AdminUsersPage.jsx:55:20
       <div className="d-flex justify-content-between align-items-center mt-3">
         <button
           className="btn btn-primary"
-          onClick={() => setPage(page - 1)}
+          onClick={() => undefined}
           disabled={page === 0}
         >
killedBy: AdminUsersPage tests clicking Previous loads page 0
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
  2

[Killed] ArithmeticOperator
main/pages/Admin/AdminUsersPage.jsx:67:34
 
         <button
           className="btn btn-primary"
-          onClick={() => setPage(page + 1)}
+          onClick={() => setPage(page - 1)}
           disabled={page + 1 >= totalPages}
         >
killedBy: AdminUsersPage tests clicking Next loads page 1
statusReason: expected [ '/api/currentUser', …(3) ] to include '/api/admin/users/paged?page=1&size=5'

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
main/pages/Admin/AdminUsersPage.jsx:68:21
         <button
           className="btn btn-primary"
           onClick={() => setPage(page + 1)}
-          disabled={page + 1 >= totalPages}
+          disabled={page + 1 > totalPages}
         >
           Next
killedBy: AdminUsersPage tests Next button is disabled on last page
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
/>
