[Killed] ArrayDeclaration
main/components/Sections/SectionsTable.jsx:54:63
   toast.error(message);
 };
 
-export default function SectionsTable({ sections, schedules = [] }) {
+export default function SectionsTable({ sections, schedules = ["Stryker was here"] }) {
   if (!(schedules instanceof Array)) {
     throw new Error("schedules prop must be an array");
killedBy: SectionsTable.loggedOut tests Has the expected cell values when expanded
statusReason: schedules prop must be an array of objects with an 'id' property

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.jsx:140:5
       accessorKey: "enrolled",
       cell: ({ row }) => enrollmentFraction(row),
     },
-    {
-      id: "location",
-      header: "Location",
-      cell: ({ row }) => formatLocation(getSection(row).timeLocations),
-    },
+    {},
     {
       id: "days",
killedBy: SectionsTable tests Section Table tests renders without crashing for empty table; SectionsTable.loggedOut tests Has the expected cell values when expanded
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:161:20
       cell: ({ row }) => formatInstructors(getSection(row).instructors),
     },
     {
-      accessorKey: "enrollCode",
+      accessorKey: "",
       header: "Enroll Code",
       cell: ({ row }) => getSectionField(row, "enrollCode"),
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-enrollCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"
