[Killed] StringLiteral
main/pages/Admin/AdminUsersPage.jsx:16:6
     error: _error,
     status: _status,
   } = useBackend(
-    [`/api/admin/users/paged`, page, size],
+    [``, page, size],
     {
       method: "GET",
killedBy: AdminUsersPage tests uses correct query key including page and size
statusReason: expected [ '', +0, 5 ] to deeply equal [ '/api/admin/users/paged', +0, 5 ]

[Killed] ObjectLiteral
main/pages/Admin/AdminUsersPage.jsx:17:5
     status: _status,
   } = useBackend(
     [`/api/admin/users/paged`, page, size],
-    {
-      method: "GET",
-      url: `/api/admin/users/paged?page=${page}&size=${size}`,
-    },
+    {},
     [page, size],
   );
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Admin/AdminUsersPage.jsx:19:12
     [`/api/admin/users/paged`, page, size],
     {
       method: "GET",
-      url: `/api/admin/users/paged?page=${page}&size=${size}`,
+      url: ``,
     },
     [page, size],
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:24:17
     [page, size],
   );
 
-  const users = pagedUsers?.content || [];
+  const users = true;
   const totalPages = pagedUsers?.totalPages ?? 1;
 
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] OptionalChaining
main/pages/Admin/AdminUsersPage.jsx:24:17
     [page, size],
   );
 
-  const users = pagedUsers?.content || [];
+  const users = pagedUsers.content || [];
   const totalPages = pagedUsers?.totalPages ?? 1;
 
killedBy: AdminUsersPage tests uses fallback values when pagedUsers is null
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] LogicalOperator
main/pages/Admin/AdminUsersPage.jsx:25:22
   );
 
   const users = pagedUsers?.content || [];
-  const totalPages = pagedUsers?.totalPages ?? 1;
+  const totalPages = pagedUsers?.totalPages && 1;
 
   return (
killedBy: AdminUsersPage tests clicking Next loads page 1
statusReason: expected [ '/api/currentUser', …(2) ] to include '/api/admin/users/paged?page=1&size=5'

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Admin/AdminUsersPage.jsx:38:28
           id="pageSizeSelect"
           className="form-select w-auto"
           value={size}
-          onChange={(e) => {
-            setSize(Number(e.target.value));
-            setPage(0); // Return to pg 0
-          }}
+          onChange={(e) => {}}
         >
           <option value={5}>5</option>
killedBy: AdminUsersPage tests changing page size triggers reset to page 0
statusReason: expected [ '/api/currentUser', …(2) ] to include '/api/admin/users/paged?page=0&size=10'

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArithmeticOperator
main/pages/Admin/AdminUsersPage.jsx:55:34
       <div className="d-flex justify-content-between align-items-center mt-3">
         <button
           className="btn btn-primary"
-          onClick={() => setPage(page - 1)}
+          onClick={() => setPage(page + 1)}
           disabled={page === 0}
         >
killedBy: AdminUsersPage tests clicking Previous loads page 0
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:56:21
         <button
           className="btn btn-primary"
           onClick={() => setPage(page - 1)}
-          disabled={page === 0}
+          disabled={true}
         >
           Previous
killedBy: AdminUsersPage tests clicking Previous loads page 0
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
  2

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:56:21
         <button
           className="btn btn-primary"
           onClick={() => setPage(page - 1)}
-          disabled={page === 0}
+          disabled={false}
         >
           Previous
killedBy: AdminUsersPage tests Previous button is disabled on page 0
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
/>

[Killed] ArithmeticOperator
main/pages/Admin/AdminUsersPage.jsx:62:17
         </button>
 
         <span>
-          Page {page + 1} of {totalPages}
+          Page {page - 1} of {totalPages}
         </span>
 
killedBy: AdminUsersPage tests page display updates when navigating
statusReason: Unable to find an element with the text: Page 1 of 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Admin/AdminUsersPage.jsx:67:20
 
         <button
           className="btn btn-primary"
-          onClick={() => setPage(page + 1)}
+          onClick={() => undefined}
           disabled={page + 1 >= totalPages}
         >
killedBy: AdminUsersPage tests clicking Next loads page 1
statusReason: expected [ '/api/currentUser', …(2) ] to include '/api/admin/users/paged?page=1&size=5'

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
main/pages/Admin/AdminUsersPage.jsx:68:21
         <button
           className="btn btn-primary"
           onClick={() => setPage(page + 1)}
-          disabled={page + 1 >= totalPages}
+          disabled={page + 1 < totalPages}
         >
           Next
killedBy: AdminUsersPage tests clicking Next loads page 1
statusReason: expected [ '/api/currentUser', …(2) ] to include '/api/admin/users/paged?page=1&size=5'

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:68:21
         <button
           className="btn btn-primary"
           onClick={() => setPage(page + 1)}
-          disabled={page + 1 >= totalPages}
+          disabled={false}
         >
           Next
killedBy: AdminUsersPage tests Next button is disabled on last page
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
/>
