[Killed] ObjectLiteral
main/components/Sections/SectionsTable.jsx:160:5
       header: "Instructor",
       cell: ({ row }) => formatInstructors(getSection(row).instructors),
     },
-    {
-      accessorKey: "enrollCode",
-      header: "Enroll Code",
-      cell: ({ row }) => getSectionField(row, "enrollCode"),
-    },
+    {},
     {
       header: "Info",
killedBy: SectionsTable.loggedOut tests Has the expected cell values when expanded; SectionsTable tests Section Table tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header
