[Killed] ObjectLiteral
main/components/PersonalSections/PersonalSectionsTable.jsx:62:22
           id: row.id,
           original: {
             quarter: row.original.quarter,
-            primary: {
-              enrollCode: section.enrollCode,
-            },
+            primary: {},
           },
           depth: 0,
killedBy: PersonalSectionsTable tests Title column renderInfoLink contains correct enrollCode
statusReason: expect(element).toHaveAttribute("href", StringContaining "12583") // element.getAttribute("href") === StringContaining "12583"

Expected the element to have attribute:
  href=StringContaining "12583"
Received:
  href="/coursedetails/20221/undefined"
