[Killed] StringLiteral
main/components/PersonalSections/PersonalSectionsTable.jsx:39:15
 
   const columns = [
     {
-      header: "Course ID",
+      header: "",
       accessorKey: "courseId",
     },
killedBy: PersonalSectionsTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Course ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="PersonalSectionsTable"

[Killed] StringLiteral
main/components/PersonalSections/PersonalSectionsTable.jsx:40:20
   const columns = [
     {
       header: "Course ID",
-      accessorKey: "courseId",
+      accessorKey: "",
     },
     {
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users; PersonalSectionsTable tests renders without crashing for empty table with user not logged in
statusReason: Unable to find an element with the text: Sections in Personal Schedule. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/PersonalSections/PersonalSectionsTable.jsx:44:13
     },
     {
       header: "Enroll Code",
-      cell: ({ cell }) => cell.row.original.classSections[0].enrollCode,
+      cell: () => undefined,
       id: "enrollCode",
     },
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users; PersonalSectionsTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  12583
Received:

[Killed] ObjectLiteral
main/components/PersonalSections/PersonalSectionsTable.jsx:47:5
       cell: ({ cell }) => cell.row.original.classSections[0].enrollCode,
       id: "enrollCode",
     },
-    {
-      header: "Section",
-      cell: ({ cell }) => cell.row.original.classSections[0].section,
-      id: "section",
-    },
+    {},
     {
       accessorKey: "title",
killedBy: PersonalSectionsTable tests renders without crashing for empty table with user not logged in
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/PersonalSections/PersonalSectionsTable.jsx:49:13
     },
     {
       header: "Section",
-      cell: ({ cell }) => cell.row.original.classSections[0].section,
+      cell: () => undefined,
       id: "section",
     },
killedBy: PersonalSectionsTable tests Has the expected column headers and content; PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  0100
Received:

[Killed] ArrowFunction
main/components/PersonalSections/PersonalSectionsTable.jsx:78:13
     },
     {
       header: "Enrolled",
-      cell: ({ cell }) =>
-        convertToFraction(
-          cell.row.original.classSections[0].enrolledTotal,
-          cell.row.original.classSections[0].maxEnroll,
-        ),
+      cell: () => undefined,
       id: "enrolled",
     },
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users; PersonalSectionsTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  84/100
Received:

[Killed] ArrowFunction
main/components/PersonalSections/PersonalSectionsTable.jsx:87:13
     },
     {
       header: "Location",
-      cell: ({ cell }) =>
-        formatLocation(cell.row.original.classSections[0].timeLocations),
+      cell: () => undefined,
       id: "location",
     },
killedBy: PersonalSectionsTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  BUCHN 1930
Received:

[Killed] StringLiteral
main/components/PersonalSections/PersonalSectionsTable.jsx:89:11
       header: "Location",
       cell: ({ cell }) =>
         formatLocation(cell.row.original.classSections[0].timeLocations),
-      id: "location",
+      id: "",
     },
     {
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users; PersonalSectionsTable tests renders without crashing for empty table with user not logged in
statusReason: Unable to find an element with the text: Sections in Personal Schedule. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/PersonalSections/PersonalSectionsTable.jsx:97:5
         formatDays(cell.row.original.classSections[0].timeLocations),
       id: "days",
     },
-    {
-      header: "Time",
-      cell: ({ cell }) =>
-        formatTime(cell.row.original.classSections[0].timeLocations),
-      id: "time",
-    },
+    {},
     {
       header: "Instructor",
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users; PersonalSectionsTable tests renders without crashing for empty table with user not logged in
statusReason: Unable to find an element with the text: Sections in Personal Schedule. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/PersonalSections/PersonalSectionsTable.jsx:99:13
     },
     {
       header: "Time",
-      cell: ({ cell }) =>
-        formatTime(cell.row.original.classSections[0].timeLocations),
+      cell: () => undefined,
       id: "time",
     },
killedBy: PersonalSectionsTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  3:00 PM - 3:50 PM
Received:

[Killed] ObjectLiteral
main/components/PersonalSections/PersonalSectionsTable.jsx:103:5
         formatTime(cell.row.original.classSections[0].timeLocations),
       id: "time",
     },
-    {
-      header: "Instructor",
-      cell: ({ cell }) =>
-        formatInstructors(cell.row.original.classSections[0].instructors),
-      id: "instructor",
-    },
+    {},
   ];
 
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users; PersonalSectionsTable tests renders without crashing for empty table with user not logged in
statusReason: Unable to find an element with the text: Sections in Personal Schedule. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/PersonalSections/PersonalSectionsTable.jsx:105:13
     },
     {
       header: "Instructor",
-      cell: ({ cell }) =>
-        formatInstructors(cell.row.original.classSections[0].instructors),
+      cell: () => undefined,
       id: "instructor",
     },
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users; PersonalSectionsTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  WANG L C
Received:
