[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:35:28
 };
 
 const onSuccess = (response) => {
-  if (response.length < 3) {
-    toast(
-      `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,
-    );
-  } else {
+  if (response.length < 3) {} else {
     toast(
       `Course ${response[0].enrollCd} replaced old section ${response[2].enrollCd} with new section ${response[1].enrollCd}`,
killedBy: SectionsTable tests Callback functions tested through user interactions onSuccess callback tests onSuccess displays a success message for new course creation
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:148:11
       cell: ({ row }) => formatLocation(getSection(row).timeLocations),
     },
     {
-      id: "days",
+      id: "",
       header: "Days",
       cell: ({ row }) => formatDays(getSection(row).timeLocations),
killedBy: SectionsTable.loggedOut tests Has the expected cell values when expanded
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:153:11
       cell: ({ row }) => formatDays(getSection(row).timeLocations),
     },
     {
-      id: "time",
+      id: "",
       header: "Time",
       cell: ({ row }) => formatTime(getSection(row).timeLocations),
killedBy: SectionsTable.loggedOut tests Has the expected cell values when expanded
statusReason: Columns require an id when using a non-string header
