[Killed] ArithmeticOperator
src/main/utils/sectionUtils.jsx:56:11
         hhmmTohhmma(timeLocationArray[index].beginTime),
         hhmmTohhmma(timeLocationArray[index].endTime),
       );
-      if (index + 1 < timeLocationArray.length) {
+      if (index - 1 < timeLocationArray.length) {
         res += `, `;
       }
killedBy: section utils tests formatTime tests formatTime test 3
statusReason: expected '3:30 PM - 4:45 PM, 10:30 AM - 11:45 A…' to be '3:30 PM - 4:45 PM, 10:30 AM - 11:45 AM' // Object.is equality

[Killed] ArrowFunction
src/main/utils/sectionUtils.jsx:105:31
 export const formatInfoLink = (row) =>
   `/coursedetails/${getQuarter(row)}/${getSectionField(row, "enrollCode")}`;
 
-export const renderInfoLink = (row, testid, title = null) => (
-  <p align="center">
-    <a
-      href={formatInfoLink(row)}
-      data-testid={`${testid}-row-${row.id}-col-info-link`}
-      target={"_blank"}
-      rel="noopener noreferrer"
-      style={{ color: "black", backgroundColor: "inherit" }}
-    >
-      {title ? title : <FontAwesomeIcon icon={faInfoCircle} />}
-    </a>
-  </p>
-);
+export const renderInfoLink = () => undefined;
 
 export function enrollmentFraction(row) {
killedBy: section utils tests renderInfoLink tests renderInfoLink test
statusReason: Cannot read properties of undefined (reading 'props')

[Killed] LogicalOperator
src/main/utils/sectionUtils.jsx:129:3
 export const isPrimary = (row) => "primary" in row.original;
 
 export const isLectureWithNoSections = (row) =>
-  isPrimary(row) && row.original.subRows.length === 0;
+  isPrimary(row) || row.original.subRows.length === 0;
 
 export const shouldShowAddToScheduleLink = (row) =>
killedBy: section utils tests tests that depend on what kind of row it is isLectureWithNoSections true test
statusReason: expected true to be false // Object.is equality
