[Killed] StringLiteral
main/components/Jobs/JobsSearchForm.jsx:26:24
             values={sortFields}
             value={sortField}
             setValue={updateSortField}
-            controlId={"JobsSearch.SortField"}
+            controlId={""}
             label="Sort By"
           />
killedBy: JobsSearchForm tests renders correctly
statusReason: Unable to find an element by: [data-testid="JobsSearch.SortField-option-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Killed] StringLiteral
main/components/Jobs/JobsSearchForm.jsx:35:24
             values={sortDirections}
             value={sortDirection}
             setValue={updateSortDirection}
-            controlId={"JobsSearch.SortDirection"}
+            controlId={""}
             label="Sort Direction"
           />
killedBy: JobsSearchForm tests renders correctly
statusReason: Unable to find an element by: [data-testid="JobsSearch.SortDirection-option-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >
