[Killed] ConditionalExpression
main/components/Jobs/JobsTable.jsx:25:13
       accessorKey: "log",
       cell: ({ cell }) => {
         const log = cell.row.original.log;
-        if (!log) {
+        if (false) {
           return (
             <div data-testid={`JobsTable-cell-row-${cell.row.index}-col-Log`}>
killedBy: JobsTable tests displays 'No logs available' when log is empty or null
statusReason: Cannot read properties of null (reading 'split')

[Killed] ConditionalExpression
main/components/Jobs/JobsTable.jsx:25:13
       accessorKey: "log",
       cell: ({ cell }) => {
         const log = cell.row.original.log;
-        if (!log) {
+        if (true) {
           return (
             <div data-testid={`JobsTable-cell-row-${cell.row.index}-col-Log`}>
killedBy: JobsTable tests renders short logs correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Single line log
Received:
  No logs available

[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:33:57
           );
         }
         const logLines = log.split("\n");
-        const truncatedLog = logLines.slice(0, 10).join("\n");
+        const truncatedLog = logLines.slice(0, 10).join("");
         return (
           <div data-testid={`JobsTable-cell-row-${cell.row.index}-col-Log`}>
killedBy: JobsTable tests renders long logs and handles truncation (snapshot)
statusReason: Snapshot `JobsTable tests > renders long logs and handles truncation (snapshot) 1` mismatched

[Killed] ConditionalExpression
main/components/Jobs/JobsTable.jsx:36:14
         const truncatedLog = logLines.slice(0, 10).join("\n");
         return (
           <div data-testid={`JobsTable-cell-row-${cell.row.index}-col-Log`}>
-            {logLines.length > 10 ? (
+            {false ? (
               <>
                 <Plaintext text={truncatedLog} />
killedBy: JobsTable tests renders long logs and handles truncation
statusReason: Unable to find an accessible element with the role "link" and name `/See entire log/i`

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] EqualityOperator
main/components/Jobs/JobsTable.jsx:36:14
         const truncatedLog = logLines.slice(0, 10).join("\n");
         return (
           <div data-testid={`JobsTable-cell-row-${cell.row.index}-col-Log`}>
-            {logLines.length > 10 ? (
+            {logLines.length >= 10 ? (
               <>
                 <Plaintext text={truncatedLog} />
killedBy: JobsTable tests does not show 'See entire log' for logs of exactly 10 lines
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  href="/admin/jobs/logs/2"
>
  See entire log
</a> instead
