[Killed] BooleanLiteral
main/components/Jobs/JobsTable.jsx:25:13
       accessorKey: "log",
       cell: ({ cell }) => {
         const log = cell.row.original.log;
-        if (!log) {
+        if (log) {
           return (
             <div data-testid={`JobsTable-cell-row-${cell.row.index}-col-Log`}>
killedBy: JobsTable tests renders short logs correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Single line log
Received:
  No logs available

[Killed] ConditionalExpression
main/components/Jobs/JobsTable.jsx:36:14
         const truncatedLog = logLines.slice(0, 10).join("\n");
         return (
           <div data-testid={`JobsTable-cell-row-${cell.row.index}-col-Log`}>
-            {logLines.length > 10 ? (
+            {true ? (
               <>
                 <Plaintext text={truncatedLog} />
killedBy: JobsTable tests does not show 'See entire log' for logs of exactly 10 lines; AdminJobsPage tests renders without crashing
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  href="/admin/jobs/logs/2"
>
  See entire log
</a> instead
